dahmedk1999/sjtwo-c-old-/projects/lpc40xx_freertos/l3_drivers/sources/OLED.c
void char_X() {
  ssp1__exch_byte(0x63);
  ssp1__exch_byte(0x14);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x14);
  ssp1__exch_byte(0x63);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_Y() {
  ssp1__exch_byte(0x07);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x70);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x07);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_Z() {
  ssp1__exch_byte(0x61);
  ssp1__exch_byte(0x51);
  ssp1__exch_byte(0x49);
  ssp1__exch_byte(0x45);
  ssp1__exch_byte(0x43);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_a() {
  ssp1__exch_byte(0x20);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x78);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_b() {
  ssp1__exch_byte(0x7F);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x38);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_c() {
  ssp1__exch_byte(0x38);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_d() {
  ssp1__exch_byte(0x38);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x7F);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_e() {
  ssp1__exch_byte(0x38);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x18);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_f() {
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x7E);
  ssp1__exch_byte(0x09);
  ssp1__exch_byte(0x01);
  ssp1__exch_byte(0x02);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_g() {
  ssp1__exch_byte(0x18);
  ssp1__exch_byte(0xA4);
  ssp1__exch_byte(0xA4);
  ssp1__exch_byte(0xA4);
  ssp1__exch_byte(0x7C);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_h() {
  ssp1__exch_byte(0x7F);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x78);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_i() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x7D);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_j() {
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x80);
  ssp1__exch_byte(0x80);
  ssp1__exch_byte(0x84);
  ssp1__exch_byte(0x7D);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_k() {
  ssp1__exch_byte(0x7F);
  ssp1__exch_byte(0x10);
  ssp1__exch_byte(0x28);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_l() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x41);
  ssp1__exch_byte(0x7F);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_m() {
  ssp1__exch_byte(0x7C);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x18);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x78);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_n() {
  ssp1__exch_byte(0x7C);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x78);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_o() {
  ssp1__exch_byte(0x38);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x38);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_p() {
  ssp1__exch_byte(0xFC);
  ssp1__exch_byte(0x24);
  ssp1__exch_byte(0x24);
  ssp1__exch_byte(0x24);
  ssp1__exch_byte(0x18);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_q() {
  ssp1__exch_byte(0x18);
  ssp1__exch_byte(0x24);
  ssp1__exch_byte(0x24);
  ssp1__exch_byte(0x28);
  ssp1__exch_byte(0xFC);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_r() {
  ssp1__exch_byte(0x7C);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x08);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_s() {
  ssp1__exch_byte(0x48);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x20);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_t() {
  ssp1__exch_byte(0x04);
  ssp1__exch_byte(0x3E);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x20);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_u() {
  ssp1__exch_byte(0x3C);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x20);
  ssp1__exch_byte(0x7C);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_v() {
  ssp1__exch_byte(0x1C);
  ssp1__exch_byte(0x20);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x20);
  ssp1__exch_byte(0x1C);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}

void char_w() {
  ssp1__exch_byte(0x3c);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x30);
  ssp1__exch_byte(0x40);
  ssp1__exch_byte(0x3C);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_x() {
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x28);
  ssp1__exch_byte(0x10);
  ssp1__exch_byte(0x28);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_y() {
  ssp1__exch_byte(0x9C);
  ssp1__exch_byte(0xA0);
  ssp1__exch_byte(0xA0);
  ssp1__exch_byte(0xA0);
  ssp1__exch_byte(0x7C);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_z() {
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x64);
  ssp1__exch_byte(0x54);
  ssp1__exch_byte(0x4C);
  ssp1__exch_byte(0x44);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
/* Danish's */
//
void char_0() {
  ssp1__exch_byte(0b00111110);
  ssp1__exch_byte(0b01010001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01000101);
  ssp1__exch_byte(0b00111110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_1() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01000010);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0b01000000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_2() {
  ssp1__exch_byte(0b01000010);
  ssp1__exch_byte(0b01100001);
  ssp1__exch_byte(0b01010001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01000110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_3() {
  ssp1__exch_byte(0b00100010);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_4() {
  ssp1__exch_byte(0b00011000);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00010010);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0b00010000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_5() {
  ssp1__exch_byte(0b00100111);
  ssp1__exch_byte(0b01000101);
  ssp1__exch_byte(0b01000101);
  ssp1__exch_byte(0b01000101);
  ssp1__exch_byte(0b00111001);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_6() {
  ssp1__exch_byte(0b00111100);
  ssp1__exch_byte(0b01001010);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b00110000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_7() {
  ssp1__exch_byte(0b00000001);
  ssp1__exch_byte(0b01110001);
  ssp1__exch_byte(0b00001001);
  ssp1__exch_byte(0b00000101);
  ssp1__exch_byte(0b00000011);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_8() {
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_9() {
  ssp1__exch_byte(0b00000110);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b00101001);
  ssp1__exch_byte(0b00011110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_dquote() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00000111);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00000111);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_squote() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00000101);
  ssp1__exch_byte(0b00000011);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_comma() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b10100000);
  ssp1__exch_byte(0b01100000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_qmark() {
  ssp1__exch_byte(0b00000010);
  ssp1__exch_byte(0b00000001);
  ssp1__exch_byte(0b01010001);
  ssp1__exch_byte(0b00001001);
  ssp1__exch_byte(0b00000110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_excl() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01011111);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_at() {
  ssp1__exch_byte(0b00110010);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01111001);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b00111110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_undersc() {
  ssp1__exch_byte(0b10000000);
  ssp1__exch_byte(0b10000000);
  ssp1__exch_byte(0b10000000);
  ssp1__exch_byte(0b10000000);
  ssp1__exch_byte(0b10000000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_star() {
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00111110);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_hash() {
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_percent() {
  ssp1__exch_byte(0b00100011);
  ssp1__exch_byte(0b00010011);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b01100100);
  ssp1__exch_byte(0b01100010);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_amper() {
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0b01001001);
  ssp1__exch_byte(0b01010101);
  ssp1__exch_byte(0b00100010);
  ssp1__exch_byte(0b01010000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_parenthL() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00011100);
  ssp1__exch_byte(0b00100010);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_parenthR() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b00100010);
  ssp1__exch_byte(0b00011100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_plus() {
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00111110);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_minus() {
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_div() {
  ssp1__exch_byte(0b00100000);
  ssp1__exch_byte(0b00010000);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0b00000010);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_colon() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_scolon() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01010110);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_less() {
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00100010);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_greater() {
  ssp1__exch_byte(0b10000010);
  ssp1__exch_byte(0b01000100);
  ssp1__exch_byte(0b00101000);
  ssp1__exch_byte(0b00010000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_equal() {
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0b00010100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_bracketL() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_backslash() {
  ssp1__exch_byte(0b00000010);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00010000);
  ssp1__exch_byte(0b00100000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_bracketR() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_caret() {
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0b00000010);
  ssp1__exch_byte(0b00000001);
  ssp1__exch_byte(0b00000010);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_bquote() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00000001);
  ssp1__exch_byte(0b00000010);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_braceL() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_braceR() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01000001);
  ssp1__exch_byte(0b00110110);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_bar() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01111111);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_tilde() {
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0b00001000);
  ssp1__exch_byte(0b00000100);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_space() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_period() {
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0b01100000);
  ssp1__exch_byte(0b01100000);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
void char_dollar() {
  ssp1__exch_byte(0b00100100);
  ssp1__exch_byte(0b00101010);
  ssp1__exch_byte(0b01101011);
  ssp1__exch_byte(0b00101010);
  ssp1__exch_byte(0b00010010);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
  ssp1__exch_byte(0x00);
}
/* ---------------End Lookup Table--------------*/
// clang-format on
void setup_lookuptable_OLED() {
  callback_OLED[(int)'A'] = char_A;
  callback_OLED[(int)'B'] = char_B;
  callback_OLED[(int)'C'] = char_C;
  callback_OLED[(int)'D'] = char_D;
  callback_OLED[(int)'E'] = char_E;
  callback_OLED[(int)'F'] = char_F;
  callback_OLED[(int)'G'] = char_G;
  callback_OLED[(int)'H'] = char_H;
  callback_OLED[(int)'I'] = char_I;
  callback_OLED[(int)'J'] = char_J;
  callback_OLED[(int)'K'] = char_K;
  callback_OLED[(int)'L'] = char_L;
  callback_OLED[(int)'M'] = char_M;
  callback_OLED[(int)'N'] = char_N;
  callback_OLED[(int)'O'] = char_O;
  callback_OLED[(int)'P'] = char_P;
  callback_OLED[(int)'P'] = char_P;
  callback_OLED[(int)'Q'] = char_Q;
  callback_OLED[(int)'R'] = char_R;
  callback_OLED[(int)'S'] = char_S;
  callback_OLED[(int)'T'] = char_T;
  callback_OLED[(int)'U'] = char_U;
  callback_OLED[(int)'V'] = char_V;
  callback_OLED[(int)'W'] = char_W;
  callback_OLED[(int)'X'] = char_X;
  callback_OLED[(int)'Y'] = char_Y;
  callback_OLED[(int)'Z'] = char_Z;
  callback_OLED[(int)'a'] = char_a;
  callback_OLED[(int)'b'] = char_b;
  callback_OLED[(int)'c'] = char_c;
  callback_OLED[(int)'d'] = char_d;
  callback_OLED[(int)'e'] = char_e;
  callback_OLED[(int)'f'] = char_f;
  callback_OLED[(int)'g'] = char_g;
  callback_OLED[(int)'h'] = char_h;
  callback_OLED[(int)'i'] = char_i;
  callback_OLED[(int)'j'] = char_j;
  callback_OLED[(int)'k'] = char_k;
  callback_OLED[(int)'l'] = char_l;
  callback_OLED[(int)'m'] = char_m;
  callback_OLED[(int)'n'] = char_n;
  callback_OLED[(int)'o'] = char_o;
  callback_OLED[(int)'p'] = char_p;
  callback_OLED[(int)'q'] = char_q;
  callback_OLED[(int)'r'] = char_r;
  callback_OLED[(int)'s'] = char_s;
  callback_OLED[(int)'t'] = char_t;
  callback_OLED[(int)'u'] = char_u;
  callback_OLED[(int)'v'] = char_v;
  callback_OLED[(int)'w'] = char_w;
  callback_OLED[(int)'x'] = char_x;
  callback_OLED[(int)'y'] = char_y;
  callback_OLED[(int)'z'] = char_z;

