dahmedk1999/sjtwo-c-old-/projects/lpc40xx_freertos/l3_drivers/sources/OLED.c
  callback_OLED[(int)'0'] = char_0;
  callback_OLED[(int)'1'] = char_1;
  callback_OLED[(int)'2'] = char_2;
  callback_OLED[(int)'3'] = char_3;
  callback_OLED[(int)'4'] = char_4;
  callback_OLED[(int)'5'] = char_5;
  callback_OLED[(int)'6'] = char_6;
  callback_OLED[(int)'7'] = char_7;
  callback_OLED[(int)'8'] = char_8;
  callback_OLED[(int)'9'] = char_9;

  callback_OLED[(int)'"'] = char_dquote;
  callback_OLED[(int)'\''] = char_squote;
  callback_OLED[(int)','] = char_comma;
  callback_OLED[(int)'?'] = char_qmark;
  callback_OLED[(int)'!'] = char_excl;
  callback_OLED[(int)'@'] = char_at;
  callback_OLED[(int)'_'] = char_undersc;
  callback_OLED[(int)'*'] = char_star;
  callback_OLED[(int)'#'] = char_hash;
  callback_OLED[(int)'%'] = char_percent;

  callback_OLED[(int)'&'] = char_amper;
  callback_OLED[(int)'('] = char_parenthL;
  callback_OLED[(int)')'] = char_parenthR;
  callback_OLED[(int)'+'] = char_plus;
  callback_OLED[(int)'-'] = char_minus;
  callback_OLED[(int)'/'] = char_div;
  callback_OLED[(int)':'] = char_colon;
  callback_OLED[(int)';'] = char_scolon;
  callback_OLED[(int)'<'] = char_less;
  callback_OLED[(int)'>'] = char_greater;

  callback_OLED[(int)'='] = char_equal;
  callback_OLED[(int)'['] = char_bracketL;
  callback_OLED[(int)'\\'] = char_backslash;
  callback_OLED[(int)']'] = char_bracketR;
  callback_OLED[(int)'^'] = char_caret;
  callback_OLED[(int)'`'] = char_bquote;
  callback_OLED[(int)'{'] = char_braceL;
  callback_OLED[(int)'}'] = char_braceR;
  callback_OLED[(int)'|'] = char_bar;
  callback_OLED[(int)'~'] = char_tilde;

  callback_OLED[(int)' '] = char_space;
  callback_OLED[(int)'.'] = char_period;
  callback_OLED[(int)'$'] = char_dollar;
}

void OLED_Start() {
  configure_OLED();
  spi1__init();

  clear_OLED();
  cs_OLED();

  power_up();
  setup_lookuptable_OLED();
  update_OLED();

  ds_OLED();
  ON__FLAG = true;
}
